tutorials/fluidSolidInteraction/3dTube/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com](https://www.openfoam.com), and owner of the  |
|              OPENFOAM® and OpenCFD® trade marks.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel linearGeometry;
//solidModel nonLinearGeometryUpdatedLagrangian;

"linearGeometryCoeffs|nonLinearGeometryUpdatedLagrangianCoeffs"
{
    // Maximum number of momentum correctors
    nCorrectors             20000;

    // Solution tolerance for displacement
    solutionTolerance       1e-09;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-09;

    // Material law solution tolerance
    materialTolerance       1e-09;

    // Write frequency for the residuals
    infoFrequency           100;
}

// ************************************************************************* //
