tutorials/fluidSolidInteraction/3dTube/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com](https://www.openfoam.com), and owner of the  |
|              OPENFOAM® and OpenCFD® trade marks.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default            Euler;
}

ddtSchemes
{
    default            Euler;
}

gradSchemes
{
    default            extendedLeastSquares 0;
}

divSchemes
{
    default            Gauss linear;
}

laplacianSchemes
{
    default            none;
    laplacian(DD,D)    Gauss linear corrected;
    laplacian(DDD,DD)  Gauss linear corrected;
}

snGradSchemes
{
    default            none;
    snGrad(D)          corrected;
    snGrad(DD)         corrected;
}

interpolationSchemes
{
    default                 none;
    interpolate(impK)       linear;
    interpolate(sigma0)     linear;
    interpolate(grad(DD))   linear;
}

// ************************************************************************* //
